Revit 2027 API
DirectShapeType.GetExternallyTaggedReference Method
 Retrieve a Reference to reference geometry of the DirectShapeType that is associated with a particular ExternalGeometryId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetExternallyTaggedReference(
	ExternalGeometryId externalId
)
Public Function GetExternallyTaggedReference (
	externalId As ExternalGeometryId
) As Reference
public:
Reference^ GetExternallyTaggedReference(
	ExternalGeometryId^ externalId
)
member GetExternallyTaggedReference :
        externalId : ExternalGeometryId -> Reference
Parameters
externalId ExternalGeometryId
 The ExternalGeometryId of the requested reference object.
Return Value
Reference
 A Reference to the externally tagged reference GeometryObject having the provided external ID or null if there is no reference geometry having the external ID.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace